package xyz.wqf31415.controller.util;

/**
 * Created by Administrator on 2019/7/12.
 *
 * @author WeiQuanfu
 */
public class NameUtil {
    public static final String[] lastNameArray = new String[]{"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
            "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
            "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
            "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
            "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹",
            "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞",
            "熊", "纪", "舒", "屈", "项", "祝", "董", "粱", "杜", "阮", "蓝", "闵", "席", "季", "麻", "强", "贾", "路", "娄", "危",
            "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍",
            "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应", "宗", "丁", "宣", "贲", "邓",
            "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁",
            "荀", "羊", "於", "惠", "甄", "麴", "家", "封", "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫",
            "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宫",
            "宁", "仇", "栾", "暴", "甘", "钭", "厉", "戎", "祖", "武", "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶",
            "郜", "黎", "蓟", "薄", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙",
            "池", "乔", "阴", "欎", "胥", "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申", "扶", "堵",
            "冉", "宰", "郦", "雍", "舄", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农",
            "温", "别", "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向", "古", "易", "慎",
            "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄", "阙", "东",
            "殴", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾", "辛", "阚",
            "那", "简", "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "後", "荆", "红",
            "游", "竺", "权", "逯", "盖", "益", "桓", "公", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛",
            "闻人", "东方", "赫连", "皇甫", "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳",
            "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐", "钟离", "宇文",
            "长孙", "慕容", "鲜于", "闾丘", "司徒", "司空", "亓官", "司寇", "仉", "督", "子车",
            "颛孙", "端木", "巫马", "公西", "漆雕", "乐正", "壤驷", "公良", "拓跋", "夹谷",
            "宰父", "谷梁", "晋", "楚", "闫", "法", "汝", "鄢", "涂", "钦", "段干", "百里", "东郭", "南门", "呼延", "归", "海",
            "羊舌", "微生", "岳", "帅", "缑", "亢", "况", "后", "有", "琴", "梁丘", "左丘",
            "东门", "西门", "商", "牟", "佘", "佴", "伯", "赏", "南宫", "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟",
            "第五", "言", "福", "百", "家", "姓", "终"};

    public static String[] firstNameArray = new String[]{"甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸", "一",
            "二", "三", "四", "五", "六", "七", "八", "九", "十", "千木", "永淼", "济通", "诚城", "若望", "焕维", "荷稳",
            "玄羽", "伊粒", "霏瑶", "奇豫", "维莲", "益铃", "万瑶", "源孟", "金滨", "维鑫", "纪雷", "宁泰", "保瑜", "敏松",
            "景康", "施琳", "奉奇", "榕远", "雨泰", "路丽", "泳笙", "潼州", "仲坤", "聪友", "迈龙", "楚莲", "湃潮", "友仪",
            "万骅", "洪通", "亦澄", "兆静", "凌萌", "渊缘", "远颜", "信怀", "任玺", "姚宁", "筱康", "汉方", "灏然", "玫琼",
            "东路", "艾乐", "胜岳", "崇龄", "立斯", "雅凰", "伊珊", "豫乐", "均康", "振京", "益衡", "桢光", "鸿伯", "权正",
            "靖杰", "旻澳", "星栋", "沁桐", "业丰", "越菲", "群钦", "兆滨", "骁轩", "雅洲", "威琦", "傲乐", "擎易", "秦鹏",
            "开石", "京君", "匀淳", "梦邱", "业宝", "先奇", "崇武", "唯之", "荟枫", "炳宁", "元泳", "钟慧", "沛岚", "惠珉",
            "燕兴", "琼逸", "秦星", "骥伦", "银维", "佳凝", "朝妮", "陆金", "钰儒", "嘉声", "利奉", "时柳", "轩亿", "孝昆",
            "奥龙", "吉焕", "培昆", "恩州", "恩韬", "绪敏", "柏崴", "固越", "文友", "敖新", "阅鼎", "思敏", "如广", "红悠",
            "晋丞", "奕鹏", "碧程", "云钊", "泳纪", "端东", "芯诺", "朝友", "祝元", "应磊", "常力", "新为", "仁暄", "恒奥",
            "珂南", "显将", "山栩", "淑荔", "紫啸", "显秀", "树邦", "业政", "荔涵", "臣善", "龙辛", "元茗", "仁想", "潜媛",
            "引紫", "隆阳", "源广", "植鸿", "奕炀", "洁靖", "荣玖", "稳程", "路轩", "学锐", "圆方", "相村", "孝锴", "绍朕",
            "永璞", "元春", "若端", "声林", "宪久", "观煜", "晖新", "足常", "云心", "汶泉", "卓茵", "先涨", "熠锦", "谷凡",
            "浩益", "通玺", "桑梓", "炜裕", "潇熙", "景丹", "蒲予", "威淇", "焕晶", "泽承", "照波", "至遥", "培廷", "增涵",
            "培心", "胜仁", "隆全", "榛航", "彦冲", "清忠", "勤本", "宜松", "千群", "应博", "贺美", "晴", "初", "诚", "崇",
            "景", "泉", "致", "祁", "锦", "羽", "瑜", "希", "璐", "筱", "若", "湘", "玥", "媱", "汐", "瑄", "羽", "霏",
            "影", "沫", "燕", "泠", "梓", "言", "斓", "璃", "落", "矞", "琅", "湛", "露", "浅", "采", "然", "流", "梦",
            "溪", "墨", "染", "冰", "绡", "舞", "野", "凝", "纱", "菡", "弈", "宸", "烨", "岚", "漠", "庭", "城", "途",
            "伯", "弘", "枭", "律", "哲", "凌", "沙", "辞", "汉", "恺", "斯", "烟", "暘", "寒", "离", "尘", "崖", "伞",
            "谪", "泽", "扬", "赫", "穆", "独", "绝", "轩"};
}
