package xyz.wqf31415.controller.util;

import org.junit.Test;

import java.io.File;
import java.io.FileOutputStream;
import java.io.IOException;
import java.util.Arrays;
import java.util.Set;
import java.util.stream.Collectors;

/**
 * Created by Administrator on 2019/7/12.
 *
 * @author WeiQuanfu
 */
public class NameUtil {

    public static final String[] lastNameArray = new String[]{"丁","万","万俟","上官","东","东方","东郭","东门","严","丰","乌","乐","乐正","乔","乜","习","于","云","亓官","井","亢","仇","仉","从","令狐","仰","仲","仲孙","任","伊","伍","伏","伯","何","佘","余","佟","佴","侯","俞","倪","傅","储","元","充","党","全","公","公冶","公孙","公羊","公良","公西","关","养","冀","冉","农","冯","况","冷","凌","凤","刁","刘","利","别","劳","勾","包","匡","华","卓","单","单于","南宫","南门","卜","卞","卢","卫","印","危","厉","厍","双","古","史","叶","司","司寇","司徒","司空","司马","吉","后","向","吕","吴","周","呼延","和","咸","哈","唐","商","喻","国","堵","墨","壤驷","夏","夏侯","夔","太叔","夹谷","奚","姓","姚","姜","姬","娄","子车","孔","孙","孟","季","宁","宇文","安","宋","宓","宗","宗政","宣","宦","宫","宰","宰父","家","容","宿","寇","富","寿","封","尉迟","尚","尤","尹","居","屈","屠","山","岑","岳","崔","嵇","巢","左","左丘","巩","巫","巫马","巴","帅","师","席","常","干","平","年","幸","广","庄","应","庞","康","庾","廉","廖","弓","弘","张","强","归","彭","後","徐","微生","怀","惠","慎","慕","慕容","戈","戎","成","戚","戴","房","扈","扶","拓跋","支","敖","文","方","於","施","时","昌","明","易","昝","晁","晋","晏","景","暨","暴","曹","曾","有","朱","权","李","杜","束","杨","杭","松","林","柏","查","柯","柳","柴","栾","桂","桑","桓","梁丘","梅","楚","樊","欎","欧阳","步","武","殳","殴","段","段干","殷","毋","毕","毛","水","汝","江","池","汤","汪","汲","沃","沈","沙","法","洪","浦","海","涂","淳于","温","游","湛","滑","滕","满","漆雕","潘","澹台","濮","濮阳","焦","熊","燕","爱","牛","牟","牧","狄","王","班","琴","璩","甄","甘","田","申","申屠","白","百","百里","皇甫","皮","益","盖","盛","相","督","瞿","石","祁","祖","祝","禄","福","禹","秋","秦","程","穆","空","窦","章","童","端木","竺","符","笪","第五","简","管","籍","米","粱","糜","索","红","纪","终","经","缑","缪","罗","羊","羊舌","羿","翁","翟","耿","聂","胡","胥","能","臧","舄","舒","艾","芮","花","苍","苏","苗","范","茅","茹","荀","荆","荣","莘","莫","萧","葛","董","蒋","蒙","蒯","蒲","蓝","蓟","蓬","蔚","蔡","蔺","薄","薛","虞","融","衡","袁","裘","裴","褚","西门","解","言","訾","詹","计","许","诸","诸葛","谈","谢","谭","谯","谷","谷梁","贝","贡","贲","费","贺","贾","赏","赖","赫连","赵","越","路","车","轩辕","辛","边","连","逄","通","逯","邓","邢","那","邬","邰","邱","邴","邵","邹","郁","郎","郏","郑","郗","郜","郝","郦","郭","都","鄂","鄢","酆","金","钟","钟离","钦","钭","钮","钱","长孙","闫","闵","闻","闻人","闾丘","阎","阙","阚","阮","阳","阴","陆","陈","陶","隆","隗","雍","雷","霍","靳","鞠","韦","韩","韶","项","须","顾","颛孙","颜","饶","马","骆","高","魏","鱼","鲁","鲍","鲜于","麴","麻","黄","黎","齐","龙","龚"};

    public static String[] firstNameArray = new String[]{"一","丁","七","万","万瑶","万骅","三","三千","丙","业丰","业宝","业政","东路","乙","九","二","云心","云钊","五","亦澄","京君","仁想","仁暄","仲坤","任玺","伊","伊珊","伊粒","伞","伯","佳凝","依","保瑜","信怀","修","傲乐","元春","元泳","元茗","兆滨","兆静","先奇","先涨","光","八","八百","六","兮","兰","冉","冰","凉","凌","凌萌","凝","初","利奉","勤本","匀淳","十","千","千木","千群","卓茵","单","友仪","吉焕","君","咎","哲","唯之","嘉声","四","固越","圆方","均康","城","培廷","培心","培昆","堕","增涵","墨","壬","声林","奇豫","奉奇","奕炀","奕鹏","奥龙","如","如广","妍","姚宁","威淇","威琦","娴","婉","婷","婼","媱","嫣","孀","孝昆","孝锴","学锐","宁泰","安","宜松","宪久","宸","寒","尕","尘","山栩","屿","岚","崇","崇武","崇龄","崖","己","希","常力","幕","应博","应磊","庚","庭","开石","弈","引","引紫","弘","彦冲","影","律","忆","念","忻","思敏","恋","恒奥","恩州","恩韬","息","恺","惜","惠珉","意","慕","慧","戊","戏","扬","挚","振京","擎易","敏","敏松","敖新","散","文友","斓","斯","新为","施琳","旧","时柳","旻澳","昕","星栋","显将","显秀","晋丞","晖新","晗","晨","景","景丹","景康","晴","暖","暘","暮","曦","朝友","朝妮","末","朽","权正","枭","柏崴","柒","染","柔","树邦","桑梓","桢光","梓","梦","梦邱","植鸿","楒","楚莲","榕远","榛航","樊","欣","此","殇","毁","永淼","永璞","汉","汉方","汐","汶泉","沁桐","沉","沙","沛岚","沫","泉","泠","泳笙","泳纪","泽","泽承","洁靖","洪通","流","浅","济通","浩益","涵","淑荔","清忠","渊缘","渲","湃潮","湘","湛","源孟","源广","溪","滥","演","漠","漩","潇熙","潜媛","潼州","澈","灏然","灭","灵","炜裕","炳宁","炽","烙","烟","烨","烯","焕晶","焕维","然","照波","熙","熠锦","燕","燕兴","独","玄羽","玉","玥","玫琼","珀","珂南","珊","珞","琅","琉","琴","琼逸","瑄","瑜","瑢","瑾","璃","璐","甲","瘾","癸","百","益衡","益铃","相村","眉","眠","瞳","矞","短","碧程","祁","祝元","祭","离","秦星","秦鹏","稳程","穆","立斯","端东","等","筱","筱康","粟","粢","紫啸","繁","红悠","纪雷","纱","绍朕","绝","绡","绪敏","绯","维莲","维鑫","群钦","羽","翎","聪友","胜仁","胜岳","臣善","至遥","致","舞","艾乐","芯诺","花","苒","若","若望","若端","荏","荔涵","荟枫","荣玖","荷稳","莉","莘","莫","菡","萘","落","蒲予","蓉","蓿","薰","虚","袅","观煜","解","言","诚","诚城","诺","谎","谧","谪","谷凡","豫乐","贺美","赎","赫","越","越菲","足常","路丽","路轩","轩","轩亿","辛","辞","迈龙","远颜","途","通玺","逝","逢","采","野","金滨","钟慧","钰儒","铭","银","银维","锦","阅鼎","阡","陆金","陌","隆全","隆阳","雅","雅凰","雅洲","雨","雨泰","霏","霏瑶","露","靖杰","静","音","韵","韶","顾","颖","颜","风","馨","骁轩","骗","骥伦","魂","鸿伯","黎","黑","黛","龙辛"};

    private String exportPath = "d:\\";

    /**
     * 将名字数组去重并导出到文件
     * @throws IOException
     */
    @Test
    public void export() throws IOException {

        Set<String> lastNameSet = Arrays.stream(lastNameArray).collect(Collectors.toSet());
        String lastNameFilePath = exportPath +"last-name.txt";
        whiteFile(lastNameFilePath, lastNameSet);

        Set<String> firstNameSet = Arrays.stream(firstNameArray).collect(Collectors.toSet());
        String firstNameFilePath = exportPath + "first-name.txt";
        whiteFile( firstNameFilePath, firstNameSet);
    }

    private void whiteFile(String fileParh, Set<String> set) throws IOException {
        File file = new File(fileParh);
        FileOutputStream outputStream = new FileOutputStream(file);
        outputStream.write('{');

        set.stream().sorted().forEach(s -> {
            try {
                outputStream.write('"');
                outputStream.write(s.getBytes());
                outputStream.write('"');
                outputStream.write(',');
            } catch (IOException e) {
                e.printStackTrace();
            }
        });
        outputStream.write('}');
        outputStream.flush();
        outputStream.close();
    }

}
